/*****************************************************************************************
 *
 * FILE NAME          : MxL251SF_PhyCfg.h
 * 
 * AUTHOR             : Brenndon Lee
 *                      Sunghoon Park
 *                      Dong Liu
 *                      Jun Huang
 *
 * DATE CREATED       : 05/18/2009
 *                      07/06/2010
 *                      08/19/2010 
 *                      06/18/2011
 *
 * DESCRIPTION        : This file contains MxL251SF common control register 
 *                      definitions
 *
 *****************************************************************************************
 *                Copyright (c) 2006, MaxLinear, Inc.
*****************************************************************************************/

#ifndef __MXL251SF_PHY_CFG_H__
#define __MXL251SF_PHY_CFG_H__

/*****************************************************************************************
    Include Header Files
    (No absolute paths - paths handled by make file)
*****************************************************************************************/
#include "MaxLinearDataTypes.h"
#include "MxL251SF_PhyCtrlApi.h"
#include "MxL251SF_OEM_Drv.h"
#include "MxL251SF_NVRAMFile.h"
#include "MxL_Debug.h"

/*****************************************************************************************
    Macros
*****************************************************************************************/

#define MAILBOX_REG_IF2_AGC_SETPT                  0xA9D4
#define MAILBOX_REG_IF3_AGC_SETPT                  0xA9D6
#define MAILBOX_REG_IF_RAMP_STEP_DURATION          0xA9D8
#define MAILBOX_REG_IF_RAMP_STEP_SIZE              0xA9DA
#define MAILBOX_REG_IF_RAMP_BOTTOM                 0xA9DC
#define MAILBOX_REG_DFE_HOSTCMD_PARAM1             0xAA24
#define MAILBOX_REG_DFE_ACTIVE_CHAN_MAP            0xAA2A
#define MAILBOX_REG_DFE_FASTSCAN_FLAG              0xAA32
#define MAILBOX_REG_FAST_WB0_AGC_FIRST             0xAA34
#define MAILBOX_REG_FAST_WB1_AGC_FIRST             0xAA36
#define MAILBOX_REG_VCO_TRHSH_IN_MHZ               0xAA3C
#define MAILBOX_REG_TILT_FLAG                      0xAA44 // MAILBOX_REG_DFE_DEBUG0
#define DEBUG0_AFEAGC_V2_TILT_ON_PLANT_MASK        (1<<0)

// Macro to return a mask of 'nbits' ones from bit 'lsbloc'.
// (please use constants for lsbloc and nbits if possible, so that compiler/preprocessor 
// can expand most of calculations)
#define MXL_MASK(lsbloc, nbits)           ((0xFFFFFFFFU>>(32-(nbits))) << (lsbloc))

#define MXL_ABS_INT32(x)                  (UINT32)(((SINT32)(x))>=0?(x):(-((SINT32)(x))))
#define MXL_ABS_REAL32(x)                 (((x)>=0)?(x):(-(x)))

#ifdef _MXL251_FIXEDPOINT_
#define MXL_IS_ZERO(x, PRECISION)         (((x) * (1 << PRECISION )) < 1) //for Fixed point numbers with 'MXL251_PRECESION' fractional bits.
#else
#define MXL_IS_REAL32_ZERO(x)             (MXL_ABS_REAL32(x)<0.000000001)
#endif

#define MXL_SIGN_EXT16(x, n)              ((SINT16)(((UINT16)(x))<<(16-(n)))>>(16-(n)))
#define MXL_SIGN_EXT32(x, n)              ((SINT32)(((UINT32)(x))<<(32-(n)))>>(32-(n)))

#ifdef _BOOT_SCAN_ENABLED_
#define BOOT_SCAN_FREQ_START      96
#define BOOT_SCAN_FREQ_STOP       864
#define BOOT_SCAN_MAX_NUM_BINS    64 // (1000MHz/16MHz)
#define BOOT_SCAN_MIN_VALID_RSSI  400
#endif // _BOOT_SCAN_ENABLED_

#define ENHANCED_CHAN_TUNE_TIMEOUT_QAM_LOCK      150000ULL   /* QAM timeout=150ms    */
#define ENHANCED_CHAN_TUNE_TIMEOUT_FEC_LOCK      50000ULL    /* FEC timeout=50ms     */
#define ENHANCED_CHAN_TUNE_TIMEOUT_MPEG_LOCK     50000ULL    /* MPEG timeou=50ms     */
#define ENHANCED_CHAN_TUNE_TIMEOUT_ALL_LOCK      2000000ULL  /* Global timeout=2s    */

#define MHZ_1                           1000000UL
#define MAX_LO_DIV_RATIO                64
#define MAX_VCO_FREQ_IN_MHZ             5000
#define MAX_VCO_FREQ_AVOID1_IN_MHZ      3450
#define MAX_VCO_FREQ_AVOID2_IN_MHZ      4600
#define FRACN_AVOIDANCE_FREQ_LIMIT_MHZ  4
#define SCALE_OVERFLOW_PROTECT          10

/*****************************************************************************************
    User-Defined Types (Typedefs)
*****************************************************************************************/

typedef enum
{
  WB_16_MHz = 16,
  WB_48_MHz = 48,
  WB_96_MHz = 96
} WB_BANDWIDTH_E;

typedef enum
{
  NB_6_MHz = 6,
  NB_8_MHz = 8,
} NB_BANDWIDTH_E;

#define NUM_ECOS_OFFSET_SEARCH 2
typedef struct
{
  UINT32                  WbCapBandWidthInMhz;
  UINT32                  WbCapFreqInHz;
  MXL_TUNER_POWER_MODE_E  TunerPowerMode;
  UINT32                  NbChanFreqInHz;
  SINT32                  FreqOffsetInHz;
  MXL_BOOL                FastScanEnable;
  UINT8                   BandWidthInMHz;

  struct
  {
    UINT8  CurQamType;
    UINT8  CurAnnexType;
#ifdef _MXL251_FIXEDPOINT_
    UINT32 CurSymbolRate;
#else
    REAL32 CurSymbolRate;	
#endif
    SINT32 LockRangeInHz; // Default to 100KHz
#ifdef _DBG_USE_LAST_LOCKED_CARRIER_OFFSET_
    SINT32 NbTunerOffsetInHz;
    SINT32 LastLockedCarrierOffset;
#endif // _DBG_USE_LAST_LOCKED_CARRIER_OFFSET_
  } Demod;

  struct
  {
    MXL_BOOL  IFEnable;
    MXL_BOOL  Polarity;
    UINT32    FreqInHz;
    UINT16    AgcSetPoint;
  } IF;

} TUNER_CONFIG_T;

/* I2C COMMAND Communication: Command Code ID */
typedef enum
{
  HOST_CMD_SET_ADDR_CFG = 1,
  HOST_CMD_DOWNLOAD_SEGMENT_CFG,
  HOST_CMD_DOWNLOAD_DONE_CFG,

  HOST_CMD_DEV_DEVICE_RESET_CFG = 10,
  HOST_CMD_DEV_XTAL_SETTINGS_CFG,
  HOST_CMD_DEV_POWER_MODE_CFG,
  HOST_CMD_DEV_OVERWRITE_DEFAULT_CFG,

  HOST_CMD_DEV_VERSION_INFO_REQ,

  HOST_CMD_DEMOD_SYMBOL_RATE_CFG = 20,
  HOST_CMD_DEMOD_MPEG_OUT_CFG,
  HOST_CMD_DEMOD_ANNEX_QAM_TYPE_CFG,
  HOST_CMD_DEMOD_INTR_MASK_CFG,
  HOST_CMD_DEMOD_INTR_CLEAR_CFG,
  HOST_CMD_DEMOD_RESET_STAT_COUNTER_CFG, 
  HOST_CMD_DEMOD_ADC_IQ_FLIP_CFG,

  HOST_CMD_DEMOD_INTR_STATUS_REQ = 30,
  HOST_CMD_DEMOD_LOCK_REQ,  // Include FEC,MPEG and QAM Lock status req
  HOST_CMD_DEMOD_SNR_REQ,
  HOST_CMD_DEMOD_BER_UNCODED_BER_CER_REQ,

  HOST_CMD_DEMOD_ANNEX_QAM_TYPE_REQ,
  HOST_CMD_DEMOD_CARRIER_OFFSET_REQ,
  HOST_CMD_DEMOD_INTERLEAVER_DEPTH_REQ,
  HOST_CMD_DEMOD_EQUALIZER_FILTER_REQ,
  HOST_CMD_DEMOD_TIMING_OFFSET_REQ,

  HOST_CMD_TUNER_WB_CAPTURE_TUNE_CFG = 50,
  HOST_CMD_TUNER_NB_CHAN_TUNE_CFG = 51,
  HOST_CMD_TUNER_NB_CHAN_DISABLE_CFG = 52,
  HOST_CMD_TUNER_AGC_LOCK_SPEED_CFG = 53,

  HOST_CMD_TUNER_DBG_IQOUT_CFG = 54,        // Internal
  HOST_CMD_TUNER_DBG_AGC_SETPOINT_CFG = 55, // Internal
  HOST_CMD_TUNER_DBG_AFE_AGC_CFG = 56,
  HOST_CMD_TUNER_POWER_REPORT_CFG = 57,
  HOST_CMD_TUNER_WB_DISABLE_CFG = 58,  

  HOST_CMD_TUNER_LOCK_STATUS_REQ = 60, 
  HOST_CMD_TUNER_RF_RX_PWR_REQ,
  HOST_CMD_TUNER_CURR_SETTING_REQ,
  HOST_CMD_TUNER_DBG_SENSOR_TEMP_REQ,  // Internal

  // MAX_NUM_HOST_COMMAND
} MXL_CMD_ID_E;

/* I2C COMMAND Communication: Response Code ID */
typedef enum
{
  RESPONSE_ID_SUCCESS = 0,
  RESPONSE_ID_NOT_READY,
  RESPONSE_ID_NOT_INTEGRATE,
  MAX_NUM_RESPONSE_ID
} MXL_RSP_ID_E;

/* Host command data structure */
typedef struct
{
  UINT8 syncChar;                    /* 0x00: Bit[7-4]:Packet sync character (0x0E),  bit[3-0]: serial */
  MXL_CMD_ID_E commandId;            /* 0x01: command opcode = 0x02 for firmware download */
  UINT8 payloadCheckSum;             /* 0x02: Checksum of packet payload */
  UINT8 payloadLen;                  /* 0x03: Length of packet payload: 1 - 252 */
  UINT8 data[MAX_COMMAND_DATA_SIZE]; /* 0x04-0x0xFF: command field data */
} HOST_COMMAND_T, *PHOST_COMMAND_T;

/* Firmware response data structure */
typedef struct
{
  UINT8 syncChar;                    /* 0x00: Bit[7-4]:Packet sync character (0x0E),  bit[3-0]: serial */
  MXL_RSP_ID_E errorCode;            /* 0x01: Error code, 0x00 means ok. */
  UINT8 payloadCheckSum;             /* 0x02: Checksum of packet payload */
  UINT8 payloadLen;                  /* 0x03: Length of packet payload: 1 - 252 */
  UINT8 data[MAX_COMMAND_DATA_SIZE]; /* 0x04-0xFF: response field data */
} FW_RESPONSE_T, *PFW_RESPONSE_T;

typedef struct
{
  UINT8 id;                 /* 0x00-0x00: file identifier ('M') */
  UINT8 fmtVersion;         /* 0x01-0x01: file format version in ascii (default to '1') */
  UINT8 headerLen;          /* 0x02-0x02: header length (<256) in bytes, should be sizeof(MBIN_FILE_HEADER_T) */
  UINT8 numSegments;        /* 0x03-0x03: number of segments in the image (<256) */
  UINT8 entryAddress[4];    /* 0x04-0x07: entry address of execution, in big endian */
  UINT8 imageSize24[3];     /* 0x08-0x0A: 24-bit image size in bytes, not including header, in big endian */
  UINT8 imageChecksum;      /* 0x0B-0x0B: 8-bit checksum of file data, not including header */
  UINT8 reserved[4];        /* 0x0C-0x0F: reserved for future use */
} MBIN_FILE_HEADER_T;

typedef struct
{
  MBIN_FILE_HEADER_T  header;    /* 0x00: file header */
  UINT8 data[1];                 /* 0x10: place holder for accessing starting of filedata */
} MBIN_FILE_T;

typedef struct
{
  UINT8 id;                      /* 0x00-0x00: segment identifier (always 'S' for now) */
  UINT8 len24[3];                /* 0x01-0x03: data length in 24-bit big endian, not including header */
                                 /* PLEASE note: */
                                 /*    len24 is the real length of following data segement, and the next memory */
                                 /*    segment (if any) will start from next 32-bit aligned address, which is   */
                                 /*    &data[(len24+3)&(~3)]                                                    */
  UINT8 address[4];              /* 0x04-0x07: loading address of this segment, in big endian                   */
} MBIN_SEGMENT_HEADER_T;


typedef struct
{
  MBIN_SEGMENT_HEADER_T header;  /* 0x00: segment header */
  UINT8 data[1];                 /* 0x08: place holder for accessing starting of data */
} MBIN_SEGMENT_T;

// MXL defined buffer structure
typedef struct
{
  UINT32 capacity;  /* capacity of buffer */
  UINT8* dataPtr;   /* buffer pointer */
  UINT32 dataLen;   /* size of content */
} MXL_BUFFER_T;

typedef struct
{
  UINT16 addr;
  UINT16 mask;
} REG_MASK_INFO_T;

typedef struct
{
  UINT16 regAddr;
  UINT16 mask;
  UINT16 data;
} REG_CTRL_INFO_T, *PREG_CTRL_INFO_T;

typedef struct
{
  UINT8 interDepthI;
  UINT8 interDepthJ;
} INTERLEAVER_LOOKUP_INFO_T, *PINTERLEAVER_LOOKUP_INFO_T;

typedef struct
{
  UINT16 lutY;
} LUTY_LOOKUP_INFO_T, *PLUTY_LOOKUP_INFO_T;

typedef enum
{
  FIRMWARE_STATUS_UNKNOWN = 0,
  FIRMWARE_STATUS_BOOTLOADER,
  FIRMWARE_STATUS_LOADED,
} FIRMWARE_STATUS_E;

typedef enum
{
  SPIN_UNTIL_EQ  = 0,
  SPIN_UNTIL_NEQ = 1,
} SPIN_CONDITION_E;

typedef enum
{
  AGC_INIT,
  AGC_CHAN_CHANGE,
  AGC_WAIT_AFE_SETTLE,
