/******************************************************************************

                  版权所有 (C), 2001-2011, 海思半导体有限公司

 ******************************************************************************
  文 件 名   : oal_hardware.c
  版 本 号   : 初稿
  作    者   : 
  生成日期   : 2013年1月26日
  最近修改   :
  功能描述   : 硬件平台相关功能接口封装
  函数列表   :
  修改历史   :
  1.日    期   : 2013年1月26日
    作    者   : 
    修改内容   : 创建文件

******************************************************************************/


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif



/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include "oal_hardware.h"
#include "oal_schedule.h"

#undef  THIS_FILE_ID
#define THIS_FILE_ID OAM_FILE_ID_OAL_HARDWARE_C

/*****************************************************************************
  2 全局变量定义
*****************************************************************************/
#if (_PRE_OS_VERSION_LINUX == _PRE_OS_VERSION)||(_PRE_OS_VERSION_LITEOS == _PRE_OS_VERSION)
oal_hi_timer_reg_stru *g_pst_reg_timer;

oal_uint32 g_aul_irq_save_time[MAX_NUM_CORES][255] = {{0},{0}};

oal_module_symbol(g_aul_irq_save_time);
oal_module_symbol(g_pst_reg_timer);

#endif

/*****************************************************************************
  3 函数实现
*****************************************************************************/


















#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

